app/controllers/home_controller.rb

  def index
    $id_face = session[:token]
    user = User.find_by(:id => session[:user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def create
  	# Caso o usuário já esteja cadastrado, ele é redirecionado para a página principal
  	user = User.find_by email: params[:email]
  	if user.nil? # Verifica se o resultado da busca é vazio
  	  user = User.new
  	  user.provider = 'aplication' 	# Diferenciação do login do Facebook
  	  user.uid = '000000000000000' 	# Apenas para manter o padrão do usuário do Facebook
  	  user.name = params[:name] 		# Parametro da requisição
  	  user.email = params[:email] 	# Parametro da requisição
  	  user.save						# Cria registro no banco de dados
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'jp_12c@hotmail.com' LIMIT 1
INSERT INTO "users" ("created_at", "email", "provider", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-12-01 19:22:17.396829"], ["email", "jp_12c@hotmail.com"], ["provider", "aplication"], ["uid", "000000000000000"], ["updated_at", "2014-12-01 19:22:17.396829"]]