app/controllers/sessions_controller.rb

  def create
    auth = request.env["omniauth.auth"]
    user = User.where(:provider => auth['provider'],
                      :uid => auth['uid']).first || User.create_with_omniauth(auth)
---
INSERT INTO "users" ("created_at", "email", "name", "provider", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "users".* FROM "users"  WHERE "users"."provider" = 'facebook' AND "users"."uid" = '376068195887486'  ORDER BY "users"."id" ASC LIMIT 1

  def login
    user = User.find_by email: params[:email] #, password: params[:password]
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'jp_12c@hotmail.com' LIMIT 1