app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-11-28 18:09:24.729030"], ["name", "Thomas"], ["updated_at", "2014-11-28 18:09:24.729030"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save